{
  "gameInfo": {
    "cardTypes": [
      {
        "rank": 10,
        "name": "英雄",
        "effect": "潜伏・転生",
        "description": "場に出すことができず、捨てさせられたら脱落する。皇帝以外に脱落させられた時に転生札で復活する。",
        "about": "英雄は、民を導く強い力を持っていますが、公に自分の姿を現すことはできません。皇帝に見つかった場合、処刑され、その場で脱落してしまいます。ただし皇帝以外に脱落させられた場合は、不老不死の力により転生札から復活できます。\n（死神・兵士・少年の効果で脱落した場合は、持っている手札を「全て」捨ててから転生札を引き、ゲームに復帰します）",
        "count": 1
      },
      {
        "rank": 9,
        "name": "皇帝",
        "effect": "公開処刑",
        "description": "指名した相手に山札から1枚引かせて、手札を2枚とも公開させる。そしてどちらか1枚を指定し捨てさせる。",
        "about": "皇帝にとって新しい教えを説く英雄は、国を混乱させる存在であるため、一刻も早く英雄を見つけ出し、処刑しようと考えています。\n王家に代々受け継がれてきた剣で英雄を処刑することで、英雄の転生を阻止することができます。",
        "count": 1
      },
      {
        "rank": 8,
        "name": "精霊",
        "effect": "交換",
        "description": "指名した相手の手札と自分の持っている手札を交換する。",
        "about": "古くからこの国を見守る精霊は、繰り返される人間たちの争いを憂いています。\n精霊の持つ特殊な力を使い、人々に夢の中で“入れ替わり”を体験させて、互いの気持ちを理解しあうことを望んでいます。",
        "count": 2
      },
      {
        "rank": 7,
        "name": "賢者",
        "effect": "選択",
        "description": "次の手番で山札から１枚引くかわりに３枚引き、そのうち１枚を選ぶことができる。残り２枚は山札へ戻す。",
        "about": "賢者はこの国の三つの未来を提示します。\n選択して有利になるカードを手に入れましょう。\n山札が残り3枚ない場合は、ある数だけ引いて1枚選びます。\n（戻した札と山札を混ぜるのは、手番プレイヤーの右隣プレイヤーが行います。その後、手札2枚のうち1枚を捨てて効果を発動させます）",
        "count": 2
      },
      {
        "rank": 6,
        "name": "貴族",
        "effect": "対決",
        "description": "指名した相手と手札を見せ合い、数字の小さい方が脱落する。数字が同じ場合は相打ちとなり、どちらも脱落する。",
        "about": "国の安定を求める貴族は、早期決着を画策しています。\n対決した相手と数字が同じだった場合、相打ちとなり、どちらも脱落します。その時、他にプレイヤーが残っていない場合は引き分けとなります。",
        "count": 2
      },
      {
        "rank": 5,
        "name": "死神",
        "effect": "疫病",
        "description": "指名した相手に山札から1枚引かせる。2枚になった相手の手札を非公開にさせたまま、1枚を指定して捨てさせる。",
        "about": "この国では「死神」と呼ばれる疫病が蔓延しています。\n死神はあらゆる人に襲いかかり、理不尽に命を奪います。\n（カードを選ぶ際は「もともと持っていたカード」と「引いたカード」がわからないようにしてから指定します）"
      },
      {
        "rank": 4,
        "name": "乙女",
        "effect": "守護",
        "description": "次の自分の手番まで自分への効果を無効にする。",
        "about": "乙女は祈りの力で霧を発生させ、攻撃から対象を守ります。\n他のプレイヤーは守護対象のプレイヤーを効果対象に選ぶことも出来ますが、その場合は効果は発動しません。"
      },
      {
        "rank": 3,
        "name": "占師",
        "effect": "透視",
        "description": "指名した相手の手札を見る。",
        "about": "占師は透視の力を持っています。\n指名したプレイヤーの手札を自分だけが見ることができます。\n透視の結果を他のプレイヤーに伝えてはいけません。",
        "count": 2
      },
      {
        "rank": 2,
        "name": "兵士",
        "effect": "捜査",
        "description": "指名した相手の手札を言い当てると相手は脱落する。",
        "about": "兵士は皇帝の命令により、捜査をしています。\n指名されたプレイヤーは、手番プレイヤーの宣言が一致しているか回答します。\n合っていた場合は手札を捨て、脱落となります。外れていた場合は、外れていることを告げます。手札が何かを教える必要はありません。",
        "count": 2
      },
      {
        "rank": 1,
        "name": "少年",
        "effect": "革命",
        "description": "1枚目の捨て札は効果なしだが、2枚目が出た時には皇帝と同じ効果「公開処刑」が発動する。",
        "about": "幼い頃の少年は無力です。\nしかしやがて成長し、英雄の教えを胸に皇帝になります。\nまだ即位したばかりの皇帝に、王家の剣を使いこなすことは難しいようです。英雄を刺してしまった場合、英雄は転生し、転生札より復活します。\n2枚目の捨て札として効果を発動する時に皇帝と同じ効果「公開処刑」が発動しますが、所持している段階ではRANKは1のままです。2枚目の少年を出すプレイヤーは1枚目の少年を出したプレイヤーと同じである必要はありません。",
        "count": 2
      }
    ],
    "setup": {
      "steps": [
        "ゲームカード18枚をよく混ぜ、机に伏せて置きます。これを「山札」と呼びます。",
        "各プレイヤーは山札からカードを1枚引き、手札とします。",
        "全員が引き終わった後、山札からカードを1枚伏せたまま取り、山札の隣に横向きに置きます。これを「転生札」と呼びます。",
        "最初に手番を行うプレイヤーを決めます。",
        "手番は時計回りで進行します。"
      ]
    },
    "gameFlow": {
      "rules": "このゲームは、「手番」と呼ばれる区切りで進行します。\n手番プレイヤーは、山札の一番上のカードを1枚引き、手札に加えます。\n2枚になった手札から1枚選び、その1枚を場に出して公開します。\n全てのカードには“効果”があり、プレイヤーはその指示に従います。（効果は必ず発動しなければなりません）\nカードの効果発動のタイミングはカードによって異なります。\n公開したカードは「捨て札」となります。\n各プレイヤーは自分の捨て札を自分の前に出します。\nその際、出した順番が分かるように、左から右へ表向きに並べていきます。\nこれらの捨て札は、他のプレイヤーが相手の手札を推理する鍵となります。\nカードの効果を発動し終えたら手番終了です。\n次は時計回りに、左隣のプレイヤーが手番を行います。\nこれを山札が無くなるか、プレイヤーが1人になるまで繰り返します。\n※転生札は、山札ではありません。「英雄」が転生した時のみ使用します。",
      "specialRules": [
        "脱落:カードの効果で脱落した場合、手札を公開し捨て札に加えます。",
        "指名:カード効果で指名する場合、自分を指名することはできません。",
        "効果発動しない時:手番プレイヤーが捨てさせたカードの効果は発動しません。"
      ]
    },
    "endGameConditions": [
      {
        "condition": "山札がなくなった時",
        "description": "脱落していないプレイヤーの中で最も強いカードを持つプレイヤーが勝者となります。"
      },
      {
        "condition": "1人を残して全員脱落した時",
        "description": "最後まで生き残ったプレイヤーが勝者となります。"
      },
      {
        "condition": "全員が脱落した時",
        "description": "プレイヤーが全員脱落した場合は引き分けとなります。"
      }
    ]
  }
}
